# GeometryElement Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryElement Class
Members See Also
---
Geometric representation of an element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GeometryElement : GeometryObject,
	IEnumerable<GeometryObject>
```

Visual Basic
---
```text
Public Class GeometryElement _
	Inherits GeometryObject _
	Implements IEnumerable(Of GeometryObject)
```

Visual C++
---
```text
public ref class GeometryElement : public GeometryObject,
	IEnumerable<GeometryObject^>
```

# Remarks
This class contains geometric primitives that are generated from the parametric description of the element. The member geometric primitives can be obtained directly from this object using the capabilities of IEnumerable.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GeometryObject Autodesk.Revit.DB..::..GeometryElement
# See Also
GeometryElement Members
Autodesk.Revit.DB Namespace